intro_text= """, 🌺✨ Добро пожаловать в наш салон красоты! ✨🌺

Приветствую вас! Меня зовут Маша, и я ваш дружелюбный чат-бот-консультант. 😊  
Я здесь, чтобы помочь вам:  
💅 Получить консультацию по услугам  
👩‍🎨 Связаться с мастерами нашего салона  
📅 Записаться на удобное время  

Если у вас есть вопросы или вам нужна помощь, просто напишите мне — я с радостью помогу! 💖  

👇 Воспользуйтесь кнопками ниже, чтобы выбрать нужное действие:  
"""
about_company="""🌸 RabendaDezaina — место, где красота встречается с искусством! 🌸

Наш салон красоты создан для тех, кто ценит стиль, качество и индивидуальный подход. Мы воплощаем ваши мечты о совершенстве, предлагая широкий спектр услуг:
💇‍♀️ Профессиональные стрижки и укладки
💅 Уход за ногтями и маникюр любого уровня сложности
🎨 Окрашивание, отвечающее последним трендам
💆‍♀️ Релаксирующие процедуры для кожи и волос

✨ Наша команда мастеров — это эксперты с многолетним опытом, которые помогут подчеркнуть вашу уникальность.

🌺 Позвольте себе немного роскоши и заботы в уютной атмосфере RabendaDezaina. Мы уверены, что каждый визит станет для вас настоящим праздником!

📍 Адрес: г. Новочеркасск, ул. Платовский проспект, д. 0
📞 Контактный номер: +7 (800) 000-00-00 """