


text_quest = '*Я готова ответить на самые популярные вопросы, которые возникают у наших клиентов. Пожалуйста, выберите интересующий вас вопрос*\n'
questions= [
    "Есть ли шанс добиться объёма на тонких волосах при помощи стрижки уровнями?",
      "Как сохранить блеск тёмных волос после окрашивания?",
      "Как сделать так, чтобы волосы меньше «жирнели»?",
    "Как часто следует стричь волосы при наличии секущихся кончиков?",
      "Как убрать «рыжину» с осветлённых волос?",
    "Как избавиться от непослушных завитков на висках или шее?",
    "Как уложить тонкие, волнистые волосы без муссов сильной фиксации?",
    "Какой шампунь следует использовать при мытье сильно вьющихся волос?",
    "Следует ли постоянно использовать шампунь и кондиционер одного и того же бренда?",
    "Как бы вы ни пытались зафиксировать объемную укладку, зимой при наличии головного убора все оказывается напрасным: макушка оказывается приплюснутой, а остальные наэлектризованные волосы торчат, как веник, в разные стороны?",
    "Как подобрать удачную стрижку для себя?",
    "Как определить тип своего лица?",
    "Как определить тип волос?",
    "Как сделать так, чтобы волосы быстрее росли?",
    "Как предотвратить выпадение волос?",
    "Как избавиться от статического электричества в волосах?",
    "Как сделать волосы более гладкими и блестящими?",
    "Как избавиться от перхоти?",
    "Как сделать так, чтобы волосы дольше оставались свежими после мытья?",
    "Как ускорить процесс сушки волос?"

  ]

answers= [
    "🌸 Да, стрижка уровнями может создать впечатление объема на тонких волосах за счет текстуры и слоями, но результат может варьироваться в зависимости от типа волос и их состояния.",

    "🌸  Чтобы сохранить блеск темных волос после окрашивания, используйте специальные шампуни и кондиционеры для окрашенных волос и избегайте частого использования тепловых инструментов для стайлинга.",

    "🌸  Чтобы уменьшить жирность волос, старайтесь не переусердствовать с маслами и кондиционерами на корнях волос, используйте шампуни для жирных волос и избегайте горячей воды при мытье.",

    "🌸  При наличии секущихся кончиков рекомендуется стричь волосы примерно раз в 6-8 недель, чтобы предотвратить дальнейшее разрушение.",

    "🌸 Чтобы убрать рыжину с осветленных волос, можно использовать фиолетовый шампунь или обратиться к профессионалу для коррекции цвета.",

    "🌸 Непослушные завитки на висках или шее можно уложить с помощью средств для укладки волос или применением утюжка для выпрямления.",

    "🌸 Для укладки тонких, волнистых волос без муссов сильной фиксации можно использовать легкие текстурирующие спреи или кремы для укладки.",

    "🌸 Для сильно вьющихся волос подойдет шампунь смягчающего действия, предназначенный для укрощения кудрей и увлажнения волос.",

    "🌸  Не обязательно использовать шампунь и кондиционер одного бренда, главное, чтобы они соответствовали вашему типу волос и решали конкретные проблемы.",

    "🌸 Чтобы сохранить объемную укладку при носке головного убора, попробуйте использовать объемные шапки или носить волосы в косичке или хвосте, чтобы снизить степень статического электричества.",

    "🌸 Удачную стрижку стоит выбирать с учетом формы лица, текстуры волос и личных предпочтений. Обратитесь к профессиональному парикмахеру, который поможет подобрать оптимальный вариант.",

    "🌸 Тип лица можно определить по ширине лба, скулам и подбородку. Существуют различные формы лица: овальное, круглое, квадратное, треугольное и другие.",

    "🌸 Тип волос определяется структурой волос (тонкие, средние, грубые), уровнем жирности, склонностью к ломкости или секущимся кончикам.",

    "🌸 Чтобы стимулировать рост волос, уделяйте внимание здоровому образу жизни, правильному питанию, уходу за волосами и массажу кожи головы.",

    "🌸 Для предотвращения выпадения волос рекомендуется уменьшить стресс, правильно питаться, избегать агрессивных воздействий на волосы и ухаживать за кожей головы.",


   "🌸 Для борьбы с статическим электричеством в волосах можно использовать антистатические средства, такие как спреи или кремы, а также избегать использования сушилки с ионизатором и натуральных щеток.",
     "🌸Чтобы сделать волосы более гладкими и блестящими, рекомендуется использовать увлажняющие маски и сыворотки, а также избегать частого использования тепловых устройств для укладки.",
    "🌸 Для избавления от перхоти рекомендуется использовать специальные шампуни против перхоти, а также маски и средства для ухода за кожей головы.",
    "🌸 Для того чтобы волосы дольше оставались свежими после мытья, рекомендуется использовать сухие шампуни и специальные увлажняющие спреи для волос.",
    "🌸 Для ускорения процесса сушки волос можно использовать микрофибровые полотенца или сушилку с функцией ионизации, а также наносить теплозащитные средства перед использованием фена."
]